W6/D5/nighty9_cats/app/controllers/cats_controller.rb

    def create
      @cat = Cat.new(cat_params)
      if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "description", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"