W6/D3/first_routers_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Luis"], ["email", "sdska@gmail.com"]]
---
  def create
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "billy"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    if user.update(params.require(:user).permit(:name, :email))