W7/D5/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "BNGnVMTpqzN7RZ32z5RT1g"], ["updated_at", "2021-10-15 22:43:54.025802"], ["id", 2]]
---
  def create
    @user = User.create(user_params)
    if @user.save